# MEPModel Properties

---
The MEPModel type exposes the following members.
| Name| Description
---|---|---
| ConnectorManager|  Retrieves the Connector Manager from this MEPModel.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
MEPModel Class
Autodesk.Revit.DB Namespace